In [57]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.preprocessing import LabelEncoder
%matplotlib inline
titanic = sns.load_dataset('titanic')
X = titanic[['sex','age','fare','class','embark_town','alone']].copy()
Y = titanic['alive']

In [58]:
print("Sex: " + str(X['sex'].isnull().sum()))
print("Age: " + str(X['age'].isnull().sum()))
print("Fare: " + str(X['fare'].isnull().sum()))
print("Class: " + str(X['class'].isnull().sum()))
print("Embark town: " + str(X['embark_town'].isnull().sum()))
print("Alone: " + str(X['alone'].isnull().sum()))

Sex: 0
Age: 177
Fare: 0
Class: 0
Embark town: 2
Alone: 0

In [59]:
mean = X['age'].mean()
mean =round(mean)
X['age'].fillna(mean,inplace = True)

In [60]:
X.isnull().sum()

sex            0
age            0
fare           0
class          0
embark_town    2
alone          0
dtype: int64

In [61]:
features = ["age", "fare"]
for feature in features:
    min_ = X[feature].mean() - (3 * X[feature].std())
    max_ = X[feature].mean() + (3 * X[feature].std())
    X1 = X[X[feature] <= max_]
    X1 = X[X[feature] >= min_]
    print(feature,    ":", X1.shape)

age : (891, 6)
fare : (891, 6)

In [62]:
X1.shape
#X1.isnull().sum()

(891, 6)

## Handle Categorical features

In [63]:
# Using a for loop and LabelEncoder
enc =  LabelEncoder()
cat_col = (X1.drop(['age','fare'],axis=1)).columns
for col in cat_col:
    X1[col] = enc.fit_transform(X1[col].astype('str'))

In [64]:
X1.head()

   sex   age     fare  class  embark_town  alone
0    1  22.0   7.2500      2            2      0
1    0  38.0  71.2833      0            0      0
2    0  26.0   7.9250      2            2      1
3    0  35.0  53.1000      0            2      0
4    1  35.0   8.0500      2            2      1

In [65]:
# Normalize features
X1 = (X1 - X1.min()) / (X1.max() - X1.min())
X1.head(10)

   sex       age      fare  class  embark_town  alone
0  1.0  0.271174  0.014151    1.0     0.666667    0.0
1  0.0  0.472229  0.139136    0.0     0.000000    0.0
2  0.0  0.321438  0.015469    1.0     0.666667    1.0
3  0.0  0.434531  0.103644    0.0     0.666667    0.0
4  1.0  0.434531  0.015713    1.0     0.666667    1.0
5  1.0  0.371701  0.016510    1.0     0.333333    1.0
6  1.0  0.673285  0.101229    0.0     0.666667    1.0
7  1.0  0.019854  0.041136    1.0     0.666667    0.0
8  0.0  0.334004  0.021731    1.0     0.666667    0.0
9  0.0  0.170646  0.058694    0.5     0.000000    0.0

In [66]:
# Normalize target variable
Y = enc.fit_transform(Y.astype('str'))